import math

def area(r):
    ''' Возвращает площадь круга с радиусом r.
                Параметры:
                    r(int): радиус
                Возвращаемое значение:
                    math.pi*r*r  - площадь круга
        Пример вызова:
            >>> area(2)
            12.566370614359172
        '''
    return math.pi * r * r


def perimeter(r):
    ''' Возвращает периметр круга с радиусом r.
                Параметры:
                    r(int): радиус
                Возвращаемое значение:
                    2*math.pi*r  - периметр круга
        Пример вызова:
            >>> perimeter(2)
            12.566370614359172
        '''
    return 2 * math.pi * r
