def area(a, b): 
    ''' Возвращает площадь прямоугольника со сторонами a,b.
            Параметры:
                a(int): первая сторона
                b(int): вторая сторона
            Возвращаемое значение:
                a*b  - площадь прямоугольника
        Пример вызова:
            >>> area(2, 3)
            6
    '''
    return a * b 

def perimeter(a, b): 
    ''' Возвращает периметр прямоугольника со сторонами a,b.
                Параметры:
                    a(int): первая сторона
                    b(int): вторая сторона
                Возвращаемое значение:
                    2*(a+b)  - периметр прямоугольника
        Пример вызова:
            >>> perimeter(2, 3)
            10
        '''
    return 2*(a + b )