
def area(a):
    ''' Возвращает площадь квадрата со стороной a.
            Параметры:
                a(int): сторона квадрата
            Возвращаемое значение:
                a*a  - площадь квадрата
        Пример вызова:
            >>> area(2)
            4
    '''
    return a * a


def perimeter(a):
    ''' Возвращает периметр квадрата со стороной a.
            Параметры:
                a(int): сторона квадрата
            Возвращаемое значение:
                4*a  - периметр квадрата
        Пример вызова:
            >>> perimeter(2)
            8
    '''
    return 4 * a
