def area(a, h):
    ''' Возвращает площадь треугольника со стороной a и высотой h.
            Параметры:
                a(int): сторона треугольника, к которой проведена высота
                h(int): высота треугольника
            Возвращаемое значение:
                a*h/2  - площадь треугольника
        Пример вызова:
            >>> area(2, 3)
            3
    '''
    return a * h / 2

def perimeter(a, b, c):
    ''' Возвращает периметр треугольника со сторонами a, b, c.
            Параметры:
                a(int): 1 сторона треугольника
                b(int): 2 сторона треугольника
                c(int): 3 сторона треугольника
            Возвращаемое значение:
                a+b+c  - периметр треугольника
        Пример вызова:
            >>> perimeter(2, 3, 4)
            9
    '''
    return a + b + c
